# Height Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..Height Property
DuctPressureDropData Class See Also
---
The height of the duct. If the duct is round, it will be equal to the diameter of the duct. Units: (ft).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Height { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Height As Double
	Get
```

Visual C++
---
```text
public:
property double Height {
	double get ();
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace